packages/sample-artillery/artillery.yml
# Performance test script
# ---------------------------------------
# - Refer to https://artillery.io/docs/
# - Rename this file to 'artillery' and update contents to enable perf tests.
# - Use 'yarn sls-perf' to run, and 'yarn sls-perf-report' to generate reports.
# - GTM CI worker nodes based on https://github.com/zotoio/gtm-worker automate this.
#
config:
  target: 'https://zzzz.execute-api.ap-southeast-2.amazonaws.com'
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/dev/sample-artillery"